Revit 2026 API

# PipeCreate(Document, ElementId, ElementId, ElementId, XYZ, XYZ) Method

---

Creates a new pipe from two points.

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Pipe Create(
	Document document,
	ElementId systemTypeId,
	ElementId pipeTypeId,
	ElementId levelId,
	XYZ startPoint,
	XYZ endPoint
)
```
```vb
Public Shared Function Create (
	document As Document,
	systemTypeId As ElementId,
	pipeTypeId As ElementId,
	levelId As ElementId,
	startPoint As XYZ,
	endPoint As XYZ
) As Pipe
```
```cpp
public:
static Pipe^ Create(
	Document^ document,
	ElementId^ systemTypeId,
	ElementId^ pipeTypeId,
	ElementId^ levelId,
	XYZ^ startPoint,
	XYZ^ endPoint
)
```
```fsharp
static member Create :
        document : Document *
        systemTypeId : ElementId *
        pipeTypeId : ElementId *
        levelId : ElementId *
        startPoint : XYZ *
        endPoint : XYZ -> Pipe
```

#### Parameters

document Document
     The document.
systemTypeId ElementId
     The ElementId of the piping system type.
pipeTypeId ElementId
     The ElementId of the pipe type.
levelId ElementId
     The level ElementId for the pipe.
startPoint XYZ
     The start point of the pipe.
endPoint XYZ
     The end point of the pipe.

#### Return Value

Pipe The pipe.

| Exception | Condition |
| --- | --- |
| ArgumentException | The systemTypeId is not valid piping system type. -or- The pipe type pipeTypeId is not valid pipe type. -or- The ElementId levelId is not a Level. -or- The points of startPoint and endPoint are too close: for MEPCurve, the minimum length is 1/10 inch. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

Pipe Class

Create Overload

Autodesk.Revit.DB.Plumbing Namespace